app/Controllers/Admin/BannerAdminController.php

SELECT *
FROM `banners`
ORDER BY `sort_order` ASC
---
    public function index()
    {
        $model = new BannerModel();
        $data = [
            'title'   => 'Manage Hero Banners & Carousel',
            'banners' => $model->orderBy('sort_order', 'ASC')->findAll(),

SELECT *
FROM `banners`
WHERE `banners`.`id` = '2'
---
    public function edit($id)
    {
        $model = new BannerModel();
        $banner = $model->find($id);

SELECT *
FROM `banners`
WHERE `banners`.`id` = '1'
---
    public function update($id)
    {
        $model = new BannerModel();
        $banner = $model->find($id);