app/Controllers/Admin/BranchAdminController.php

SELECT *
FROM `branches`
ORDER BY `id` DESC
---
    public function index()
    {
        $branchModel = new BranchModel();
        $data = [
            'title'    => 'Manage Branches',
            'branches' => $branchModel->orderBy('id', 'DESC')->findAll(),