app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `branches`
SELECT COUNT(*) AS `numrows`
FROM `account_applications`
SELECT COUNT(*) AS `numrows`
FROM `account_applications`
WHERE `status` = 'new'
SELECT COUNT(*) AS `numrows`
FROM `enquiries`
SELECT COUNT(*) AS `numrows`
FROM `enquiries`
WHERE `status` = 'new'
SELECT COUNT(*) AS `numrows`
FROM `banners`
SELECT COUNT(*) AS `numrows`
FROM `notices`
SELECT *
FROM `account_applications`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `enquiries`
ORDER BY `id` DESC
 LIMIT 5
---
    public function index()
    {
        $depositModel = new DepositModel();
        $loanModel    = new LoanModel();
        $branchModel  = new BranchModel();
        $accountModel = new AccountApplicationModel();
        $enquiryModel = new EnquiryModel();
        $bannerModel  = new BannerModel();
        $noticeModel   = new NoticeModel();

        $data = [
            'title'               => 'Admin Dashboard',
            'deposit_count'       => $depositModel->countAllResults(),
            'loan_count'          => $loanModel->countAllResults(),
            'branch_count'        => $branchModel->countAllResults(),
            'account_count'       => $accountModel->countAllResults(),
            'new_accounts'        => $accountModel->where('status', 'new')->countAllResults(),
            'enquiry_count'       => $enquiryModel->countAllResults(),
            'new_enquiries'       => $enquiryModel->where('status', 'new')->countAllResults(),
            'banner_count'        => $bannerModel->countAllResults(),
            'notice_count'        => $noticeModel->countAllResults(),
            'recent_applications' => $accountModel->orderBy('id', 'DESC')->findAll(5),
            'recent_enquiries'    => $enquiryModel->orderBy('id', 'DESC')->findAll(5),