app/Controllers/Admin/NoticeAdminController.php

    public function index()
    {
        $model = new NoticeModel();
        $data = [
            'title'   => 'Manage Notices & Announcements',
            'notices' => $model->orderBy('id', 'DESC')->findAll(),
---
SELECT *
FROM `notices`
ORDER BY `id` DESC