app/Models/BannerModel.php

    public function getActiveBanners()
    {
        return $this->where('is_active', 1)->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `banners`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC