app/Models/BranchModel.php

    public function getActiveBranches()
    {
        return $this->where('is_active', 1)->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `branches`
WHERE `is_active` = 1
ORDER BY `id` ASC