app/Models/NoticeModel.php

SELECT *
FROM `notices`
WHERE `is_active` = 1
ORDER BY `publish_date` DESC
---
    public function getActiveNotices()
    {
        return $this->where('is_active', 1)->orderBy('publish_date', 'DESC')->findAll();