app/Models/PageModel.php

    public function getBySlug($slug)
    {
        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `pages`
WHERE `slug` = 'accounts'
 LIMIT 1