app/Models/ServiceModel.php

SELECT *
FROM `services`
WHERE `category` = 'banking'
ORDER BY `sort_order` ASC, `id` ASC
---
    public function getByCategory(string $category)
    {
        return $this->where('category', $category)
            ->orderBy('sort_order', 'ASC')
            ->orderBy('id', 'ASC')
            ->findAll();

SELECT *
FROM `services`
WHERE `category` = 'account'
AND `is_active` = 1
ORDER BY `sort_order` ASC, `id` ASC
---
    public function getActiveByCategory(string $category)
    {
        return $this->where('category', $category)
            ->where('is_active', 1)
            ->orderBy('sort_order', 'ASC')
            ->orderBy('id', 'ASC')
            ->findAll();