app/Models/SettingModel.php

SELECT *
FROM `settings`
---
    public function getAllAsKeyValue()
    {
        $settings = $this->findAll();