app/Models/TestimonialModel.php

SELECT *
FROM `testimonials`
WHERE `is_active` = 1
ORDER BY `id` DESC
---
    public function getActiveTestimonials()
    {
        return $this->where('is_active', 1)->orderBy('id', 'DESC')->findAll();